Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveTogether Property
 Can't move these elements at the same time. One of them is restricted to moving in one direction while the other is restricted to moving in a conflicting direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveTogether { get; }
Public Shared ReadOnly Property CannotMoveTogether As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveTogether {
	FailureDefinitionId^ get ();
}
static member CannotMoveTogether : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace